import os
import math
import random
class MOST_USELESS_CLASS:
  def output(args):
    print(args)
  def input(args):
    input(args)
    print(args)
  def execute(args):
    exec(args)
  def MOST_USELESS_FUNC():
    print(2+2*2+2/9) 
  def MOST_USELESS_INFO():
    print(os.environ,os.environ.get)
  def MOST_MATH_INFO():
    print(math.pi+math.e/999)  
  def MOST_NONE_INFO():
    print(None)
  def MOST_TRUE_INFO():
    print(True)
  def MOST_FALSE_INFO():
    print(False)
  def MOST_MOST_INFO():
    most = ["MOST","MUST","most","Most","mOst","moSt","mosT","MOSt"] 
    print(random.choice(most))
  def MOST_GITHUB_INFO():
    print('''
GitHub
Материал из Википедии — свободной энциклопедии
GitHub
Изображение логотипа
URL 	github.com (англ.)
Коммерческий 	да
Тип сайта 	интернет-сервис[d], forge[d], архив данных[d], Identity Provider, веб-приложение, служба хостинга репозитория[d], веб-интерфейс репозитория[d], социальная сеть, краудсорсинговый проект[d], система отслеживания заявок[d], code reviewing software[d], вики-движок и система непрерывной интеграции[d]
Регистрация 	необязательна для просмотра
Язык (-и) 	английский[1], ранее многоязычный[2]
Владелец 	Майкрософт[4][5]
Создатель 	Крис Ванстрас, Пи Джей Хайетт и Том Престон-Вернер
Начало работы 	апрель 2008 года[3]
Текущий статус 	работает
Страна 	

     США

Логотип Викисклада Медиафайлы на Викискладе

GitHub — крупнейший[6] веб-сервис для хостинга IT-проектов и их совместной разработки.

Веб-сервис основан на системе контроля версий Git и разработан на Ruby on Rails[7] и Erlang компанией GitHub, Inc (ранее Logical Awesome)[8]. Сервис бесплатен для проектов с открытым исходным кодом и (с 2019 года) небольших частных проектов, предоставляя им все возможности (включая SSL[9]), а для крупных корпоративных проектов предлагаются различные платные тарифные планы[10].

Слоган сервиса — «Social Coding» — на русский можно перевести как «Пишем код вместе». На футболках же печатают совсем другую фразу: «Fork you!» («Ветвить тебя!»)[11]. С одной стороны, она созвучна с англоязычным ругательством и намекает на неформальную атмосферу. С другой, эти слова напоминают, что создавать новые форки с Git можно легко и безболезненно — традиционно, к созданию веток разработчики проектов с открытым исходным кодом относятся негативно[12] — а также созвучна названию одной из возможностей GitHub — очереди форков[13].

Талисманом GitHub выбран осьмикот (англ. octocat), который, вопреки распространённому заблуждению, не имеет отношения к короткометражке «Octocat Adventure», а просто был найден Томом Престон-Вернером на сервисе iStock  (англ.)рус.[14].

4 июня 2018 года Microsoft купила GitHub за 7,5 млрд долларов[15][16][17].
Содержание

    1 Возможности
    2 Популярность
    3 Примечания
    4 Ссылки

Возможности

Создатели сайта называют GitHub «социальной сетью для разработчиков».

Кроме размещения кода, участники могут общаться, комментировать правки друг друга, а также следить за новостями знакомых.

С помощью широких возможностей Git программисты могут объединять свои репозитории — GitHub предлагает удобный интерфейс для этого и может отображать вклад каждого участника в виде дерева.

Для проектов есть личные страницы, небольшие Вики и система отслеживания ошибок.

Прямо на сайте можно просмотреть файлы проектов с подсветкой синтаксиса для большинства языков программирования.

    Можно создавать приватные репозитории, которые будут видны только вам и выбранным вами людям. Раньше такая возможность была платной.
    Есть возможность прямого добавления новых файлов в свой репозиторий через веб-интерфейс сервиса[18].
    Код проектов можно не только скопировать через Git, но и скачать в виде обычных архивов с сайта.
    Кроме Git, сервис поддерживает получение и редактирование кода через SVN[19][20] и Mercurial[21].
    На сайте есть pastebin-сервис gist.github.com для быстрой публикации фрагментов кода.
    Файлы из репозитория могут автоматически публиковаться в виде статического сайта с помощью GitHub Pages.

Ранее Ruby-проекты могли быть автоматически опубликованы в RubyGems-репозитории сервиса, но в октябре 2009 GitHub отказался от этого сервиса[22].

В 2019 году был запущен сервис GitHub Packages[23], позволяющий публиковать прямо на GitHub пакеты RubyGems, NuGet, npm, Maven, а также образы Docker[24].

В том же году состоялся релиз системы автоматизации GitHub Actions[25]. Помимо стандартных возможностей CI/CD, таких как сборка, тестирование и публикация кода, сервис предлагает тесную интеграцию с другими функциями GitHub, а также позволяет взаимодействовать со сторонними сервисами[26]. Разработчики могут публиковать переиспользуемые модули (actions), реализующие часто используемые сценарии. Сервис предоставляется бесплатно для публичных репозиториев.

GitHub ограничивает перечень возможностей для пользователей, проживающих в странах и регионах, на которые распространяются американские ограничения и санкции, таких как Россия, Крым, Куба, Иран, Северная Корея и Сирия[27].
Популярность

Первый частный репозиторий был создан 12 января 2008. К концу 2011 года в проекте уже было зарегистрировано более миллиона пользователей[28] и более двух миллионов репозиториев[29]. По состоянию на март 2017 года на сайте существовало более 58 миллионов репозиториев.[30]

В конце 2008 года GitHub получил награду как «Лучший стартап-дебют»[31].

На Github располагается копия[32] исходного кода ядра Linux.[33]

Многие крупные IT-компании размещают свои официальные репозитории на этом сервисе:[34]

    Facebook[35]
    Twitter[36]
    Telegram
    Google
    HP webOS[37]

	

    Yahoo[38]
    RedHat[39]
    Microsoft
    Valve[40]
    Apple[41]

На GitHub размещают свои открытые проекты федеральные агентства США.[42]
Примечания

GitHub will switch to English-only on Friday, May 20, 2011
GitHub in your language. Дата обращения: 21 июля 2010. Архивировано 19 июля 2010 года.
«We Launched» Архивная копия от 12 марта 2015 на Wayback Machine // GitHub Blog
Microsoft to acquire GitHub for $7.5 billion (англ.) — 2018.
A bright future for GitHub (англ.) — 2018.
GitHub Dominates the Forges — GitHub. Дата обращения: 5 июля 2011. Архивировано 21 апреля 2014 года.
Ruby on Rails: Applications. Архивировано 30 апреля 2012 года.
Meet the Developers. GitHub. Дата обращения: 20 января 2009. Архивировано 23 ноября 2008 года.
«Sidejack Prevention Phase 2: SSL Everywhere». Дата обращения: 11 июля 2011. Архивировано 21 апреля 2014 года.
Plans & Pricing. GitHub. Дата обращения: 20 января 2009. Архивировано 24 ноября 2010 года.
«GitHub Shirts Now Available!» Дата обращения: 7 апреля 2009. Архивировано 1 апреля 2009 года.
«Look at the Numbers!» Дата обращения: 29 мая 2009. Архивировано из оригинала 5 апреля 2006 года.
The Fork Queue — GitHub. Дата обращения: 4 октября 2011. Архивировано 27 мая 2010 года.
What is the story behind Github’s octocat mascot? на Quora, ответ PJ Hyett.
A bright future for GitHub | The GitHub Blog. Дата обращения: 4 июня 2018. Архивировано 6 июня 2018 года.
Microsoft + GitHub = Empowering Developers — The Official Microsoft Blog. Дата обращения: 4 июня 2018. Архивировано 6 июня 2018 года.
Microsoft to acquire GitHub for $7.5 billion | Stories. Дата обращения: 4 июня 2018. Архивировано 4 июня 2018 года.
Creating files on GitHub · GitHub Blog. Дата обращения: 29 января 2013. Архивировано 23 декабря 2012 года.
Announcing SVN Support — GitHub. Дата обращения: 12 октября 2011. Архивировано 21 ноября 2016 года.
Subversion Write Support — GitHub. Дата обращения: 12 октября 2011. Архивировано 6 марта 2017 года.
Hg-Git plugin for Mercurial, adding the ability to push to and pull from a Git server repository from Mercurial. Дата обращения: 28 сентября 2017. Архивировано из оригинала 16 марта 2013 года.
Gem Building is Defunct — GitHub. Дата обращения: 10 ноября 2009. Архивировано 9 декабря 2009 года.
GitHub Packages is generally available | GitHub Changelog (англ.). The GitHub Blog. Дата обращения: 1 августа 2022. Архивировано 1 августа 2022 года.
GitHub Packages: Your packages, at home with their code (англ.). GitHub. Дата обращения: 1 августа 2022. Архивировано 31 июля 2022 года.
GitHub Actions is generally available | GitHub Changelog (англ.). The GitHub Blog. Дата обращения: 1 августа 2022. Архивировано 25 октября 2021 года.
Features • GitHub Actions (англ.). GitHub. Дата обращения: 1 августа 2022. Архивировано 31 июля 2022 года.
GitHub начал блокировать российских разработчиков. Дата обращения: 9 сентября 2021. Архивировано 9 сентября 2021 года.
One Million — GitHub. Дата обращения: 30 декабря 2011. Архивировано 26 сентября 2013 года.
Those are some big numbers — GitHub. Дата обращения: 30 декабря 2011. Архивировано 21 апреля 2014 года.
Build software better, together (англ.). GitHub. Дата обращения: 3 мая 2017. Архивировано 23 июня 2011 года.
Congratulations To the Crunchies Winners; Facebook Takes Top Prize For Second Year. Дата обращения: 28 сентября 2017. Архивировано 30 июля 2017 года.
Why Github can't host the Linux Kernel Community (англ.). Дата обращения: 27 января 2021. Архивировано 11 декабря 2020 года.
torvalds/linux (англ.). GitHub. Дата обращения: 8 июня 2018. Архивировано 4 июня 2018 года.
Popular Watched Repositories — GitHub Архивировано 19 апреля 2010 года.
facebook’s Profile — GitHub. Дата обращения: 10 января 2010. Архивировано 4 января 2017 года.
twitter’s Profile — GitHub. Дата обращения: 19 марта 2012. Архивировано 4 января 2017 года.
palm’s Profile — GitHub. Дата обращения: 10 января 2010. Архивировано 4 июня 2018 года.
yahoo’s Profile — GitHub. Дата обращения: 10 января 2010. Архивировано 4 января 2017 года.
RedHat’s Developer Profile — GitHub. Дата обращения: 8 июня 2018. Архивировано 5 февраля 2019 года.
Valve’s Profile — GitHub. Дата обращения: 30 апреля 2013. Архивировано 4 января 2017 года.
Apple’s Profile — GitHub. Дата обращения: 4 июня 2016. Архивировано 12 января 2017 года.

    Архивированная копия. Дата обращения: 8 февраля 2017. Архивировано 14 февраля 2017 года.

Ссылки

    GitHub.com
    7 ways Github has changed the open source world // Honza Pokorny, 2011; Семь аспектов, как Github изменил мир открытого программного обеспечения (перевод)

[показать]Перейти к шаблону «Системы отслеживания ошибок» 
Системы отслеживания ошибок (сравнение)
[показать]Перейти к шаблону «Программное обеспечение для управления проектами» 
Программное обеспечение для управления проектами
Категории:

    Сайты по алфавитуСайты, появившиеся в 2008 годуПрограммное обеспечение для управления проектамиХостинг проектов свободного программного обеспеченияRubyGitHubПоглощения MicrosoftGit

Навигация

    Вы не представились системе
    Обсуждение
    Вклад
    Создать учётную запись
    Войти

    Статья
    Обсуждение

    Читать
    Править
    Править код
    История

Поиск

    Заглавная страница
    Содержание
    Избранные статьи
    Случайная статья
    Текущие события
    Пожертвовать

Участие

    Сообщить об ошибке
    Как править статьи
    Сообщество
    Форум
    Свежие правки
    Новые страницы
    Справка

Инструменты

    Ссылки сюда
    Связанные правки
    Служебные страницы
    Постоянная ссылка
    Сведения о странице
    Цитировать страницу

Печать/экспорт

    Скачать как PDF
    Версия для печати

В других проектах

    Викисклад
    Медиавики
    Викиновости
    Элемент Викиданных

На других языках

    Azərbaycanca
    English
    Suomi
    हिन्दी
    Հայերեն
    Српски / srpski
    Татарча / tatarça
    اردو
    中文

Править ссылки

    Эта страница в последний раз была отредактирована 2 августа 2023 в 13:47.
    Текст доступен по лицензии Creative Commons «С указанием авторства — С сохранением условий» (CC BY-SA); в отдельных случаях могут действовать дополнительные условия. Подробнее см. Условия использования.
    Wikipedia® — зарегистрированный товарный знак некоммерческой организации Фонд Викимедиа (Wikimedia Foundation, Inc.)

    Политика конфиденциальности
    Описание Википедии
    Отказ от ответственности
    Свяжитесь с нами
    Кодекс поведения
    Мобильная версия
    Разработчики
    Статистика
    Заявление о куки

    Wikimedia Foundation
    Powered by MediaWiki

          
''')
  def THE_MOST_MOST_MOST_USELESS_FUNC():
    print(str(1))
    if True == True:
      if False != True:
        while False:
          True,False
  def MOST_STUFF_THAT_ACTIVATE_ALL_OF_THIS_AND_DEACTIVATE_THEMSELF_WHILE_YOU_DONT_STOP_IT():
    while True:
      exit()
  def MOST_STUFF_THAT_ACTIVATE_ALL_OF_THIS_AND_ACTIVATE_THEMSELF_WHILE_YOU_DONT_STOP_IT():
    MOST_USELESS_CLASS.output(None)  
    a = MOST_USELESS_CLASS.input("y or n: ")
    if a == "y":
      MOST_USELESS_CLASS.execute(MOST_USELESS_CLASS.MOST_STUFF_THAT_DEACTIVATE_ALL_OF_THIS_AND_ACTIVATE_THEMSELF_WHILE_YOU_DONT_STOP_IT())
    elif a == "n":
      pass
    else:
      print("y or n")
    MOST_USELESS_CLASS.MOST_USELESS_FUNC()
    MOST_USELESS_CLASS.MOST_USELESS_INFO()
    MOST_USELESS_CLASS.MOST_MATH_INFO()
    MOST_USELESS_CLASS.MOST_NONE_INFO()
    MOST_USELESS_CLASS.MOST_TRUE_INFO()
    MOST_USELESS_CLASS.MOST_FALSE_INFO()
    MOST_USELESS_CLASS.MOST_MOST_INFO()
    MOST_USELESS_CLASS.MOST_GITHUB_INFO()
    MOST_USELESS_CLASS.MOST_STUFF_THAT_ACTIVATE_ALL_OF_THIS_AND_ACTIVATE_THEMSELF_WHILE_YOU_DONT_STOP_IT()

MOST_USELESS_CLASS.MOST_STUFF_THAT_ACTIVATE_ALL_OF_THIS_AND_ACTIVATE_THEMSELF_WHILE_YOU_DONT_STOP_IT()
